#pragma once

// ===================================
// 【クラス概要】
// DirectX11 のテクスチャクラス
// ===================================


// ===================================
// ヘッダー
// ===================================
// DirectXヘッダー
#include <d3d11.h>
// スマートポインタ
#include <wrl/client.h>


// ===================================
// クラス
// ===================================
class DirectX11_Texture2DData 
{
private:
	// -----------------------------------
	// メンバー変数
	// -----------------------------------
	// テクスチャ本体
	Microsoft::WRL::ComPtr<ID3D11Texture2D> m_Texture2D;

	// -----------------------------------
	// デバッグ用
	// -----------------------------------
	

public:
	// -----------------------------------
	// コンストラクタ・デストラクタ
	// -----------------------------------
	DirectX11_Texture2DData() = default;
	~DirectX11_Texture2DData() = default;

	// -----------------------------------
	// メンバー関数
	// -----------------------------------
	// 作成
	bool Create_DX11Texture2D();
};

