#pragma once

// ===============================================
// クラス概要
// モデルロードモジュール
// モデルをロードしてモデルデータを返す
// ===============================================


// ===============================================
// ヘッダー
// ===============================================
// モデルデータヘッダー
#include "ModelData.h"
// 文字列ヘッダー
#include "UTF8_String.h"


// ===============================================
// クラス
// ===============================================
class ModelLoadeModule final
{
private:
	// --------------------------------
	// メンバー変数
	// --------------------------------
	// モデル読み込みパス
	const String& kModelPath;


public:
	// --------------------------------
	// コンストラクタ・デストラクタ
	// --------------------------------
	ModelLoadeModule(const String& _config) :
		kModelPath(_config)
	{}
	~ModelLoadeModule() = default;


	// --------------------------------
	// メンバー関数
	// --------------------------------
	// モデル読み込み内部関数
	ModelData ModelLoad(const String& modelPath, const String& modelFile = u8"");
};

