#pragma once

// =======================================
// クラス概要
// シェーダーをリファレンスして書き出すクラス
// =======================================


// =======================================
// ヘッダー
// =======================================
// 文字列ヘッダー
#include "../../../UTF8_String.h"


// =======================================
// クラス
// =======================================
class DirectX11_References final
{
private:


public:
	// --------------------------------
	// コンストラクタ・デストラクタ
	// --------------------------------
	DirectX11_References() = default;
	~DirectX11_References() = default;



};
