#pragma once

// =========================================
// 【クラス概要】
// バイナリデータ参照クラス (実態を持たない)
// 書き換え不可能
// =========================================


// =========================================
// ヘッダー
// =========================================
#include <cstddef>


// =========================================
// クラス
// =========================================
class BinaryView
{
private:
	// ----------------------------------------
	// メンバー変数
	// ----------------------------------------
	const std::byte* m_Data;
	size_t m_Size;

public:
	// ----------------------------------------
	// コンストラクタ
	// ----------------------------------------
	BinaryView(const void* data, size_t size)
		: m_Data(static_cast<const std::byte*>(data)), m_Size(size) {
	}

	// ----------------------------------------
	// ゲッター
	// ----------------------------------------
	const std::byte* GetData() const noexcept { return m_Data; }
	size_t GetSize() const noexcept { return m_Size; }
};
