#pragma once

// ===================================
// 【構造体概要】
//  コライダーの設定
// ===================================


// ===================================
// ヘッダー
// ===================================
// 計算ヘッダー
#include "Vector3.h"


// ===================================
// コライダーのタグ
// ===================================
enum ColliderTag {
	NON = -1, // タグなし
};


// ===================================
// 構造体
// ===================================
// コライダー設定構造体
struct ColliderPresetConfig
{
	// オフセット
	Vector3 offset = {};
	// サイズスケール
	Vector3 sizeScale = {};

	// コライダーのタイプなどを追加予定
	ColliderTag tag;
};
