#pragma once

// ===================================
// 【構造体概要】
//  コライダーの設定
// ===================================


// ===================================
// ヘッダー
// ===================================
// 計算ヘッダー
#include "Vector3.h"
// 固定長整数ヘッダー
#include <cstdint>


// ===================================
// 列挙型
// ===================================
// コライダー形状タイプ
enum ColliderShapeType
{
	AABB = 0,
};

// コライダータグ
enum ColliderTag : uint32_t
{
	NOTAG = 0,
	PLAYER = 1 << 0,
	ENEMY = 1 << 1,
	ITEM = 1 << 2,
};
 

// ===================================
// 構造体
// ===================================
// コライダー設定構造体
struct ColliderPresetConfig
{
	// オフセット
	Vector3 offset = {};
	// サイズスケール
	Vector3 sizeScale = {};

	// コライダーの形状タイプ
	ColliderShapeType shapeType;
	// コライダータイプ
	ColliderTag tag;
};
