#include "GameMainState.h"


// ========================================
// シーンの初期化
// ========================================
bool GameMainState::DerivativeInit()
{
	return true;
}


// ========================================
// シーンの更新
// ========================================
void GameMainState::DerivatIveUpdate(float _delta)
{
}


// ========================================
// シーンの描画
// ========================================
void GameMainState::Draw()
{
}


// ========================================
// シーンの終了処理
// ========================================
void GameMainState::Uninit()
{
}
