#pragma once

// ===============================================
// 構造体
// メッシュマテリアルカラー情報
// ===============================================


// ===============================================
// ヘッダー
// ===============================================
#include "Color.h"


// ===============================================
// 構造体
// ===============================================
struct MeshMaterialColor
{
	// ディフューズカラー
	Color diffuseColor = Color(1.0f, 1.0f, 1.0f, 1.0f);
	// スペキュラカラー
	Color specularColor = Color(1.0f, 1.0f, 1.0f, 1.0f);
	// アンビエントカラー
	Color ambientColor = Color(1.0f, 1.0f, 1.0f, 1.0f);
};
