#pragma once

// ===============================================
// クラス概要
// メッシュマテリアルマネージャー
// ===============================================


// ===============================================
// ヘッダー
// ===============================================
// ハンドルヘッダー
#include "Handle.h"
// テンプレートマネージャーヘッダー
#include "TemplateManager.h"
// 色ヘッダー
#include "Color.h"
// 配列ヘッダー
#include <array>


// ===============================================
// クラス
// ===============================================
class MeshMaterialManager
{
private:
	// --------------------------------
	// メンバー変数
	// --------------------------------
	// メッシュマテリアルデータマネージャー
	TemplateManager<std::array<Color, 3>> m_MeshMaterialManager;


public:
	// -------------------------------
	// コンストラクタ・デストラクタ
	// -------------------------------
	MeshMaterialManager() = default;
	~MeshMaterialManager() = default;


	// -------------------------------
	// メッシュマテリアルデータを追加
	// -------------------------------
	Handle AddMeshMaterialData(const char* _name, const std::array<Color, 3>& _color);


	//-------------------------------
	// メッシュマテリアルデータを取得
	// -------------------------------
	std::array<Color, 3>* GetMeshMaterialData(const Handle& _handle);
};

