#pragma once

// ==============================
// 【クラス概要】
// モデルマネージャー
// モデル描画に必要な情報と
// バッファの名前を知っている
// ==============================


// ==============================
// ヘッダー
// ==============================
// メッシュや頂点などの構造体
#include "MeshData.h"
// 配列
#include <vector>


// ==============================
// 構造体
// ==============================
struct ModelData {

};


// ==============================
// クラス
// ==============================
class ModelManager
{
private:

public:

};
