#pragma once

// ===============================================
// クラス概要
// モデルローダーモジュール
// モデルをロードしてモデルデータを返す
// 今は.obj形式のみ対応
// ===============================================


// ===============================================
// ヘッダー
// ===============================================
// モデルデータヘッダー
#include "ModelData.h"


// ===============================================
// クラス
// ===============================================
class ModelLoadeModule
{
private:
	// --------------------------------
	// メンバー変数
	// --------------------------------
	// モデル読み込みパス
	const char* kModelPath;
	// 対応拡張子
	const char* kObjExtension = ".obj";


public:
	// --------------------------------
	// コンストラクタ・デストラクタ
	// --------------------------------
	ModelLoadeModule(const char* _config) :
		kModelPath(_config)
	{}
	~ModelLoadeModule() = default;


	// --------------------------------
	// メンバー関数
	// --------------------------------
	// モデル読み込み内部関数
	ModelData ModelLoad(const char* modelPath, const char* modelFile = "");

	// モデル読込パスを返す
	const char* GetModelLoadPath() const { return kModelPath; }
};

