#pragma once

// ==========================================
// 【構造体概要】
// モデルハンドル構造体
// モデル描画に使用するAPIオブジェクトのハンドルを管理するハンドル
// ==========================================


// ==========================================
// ヘッダー
// ==========================================
// ハンドル構造体
#include "Handle.h"
// 配列保持ヘッダー
#include <vector>


// ==========================================
// 構造体定義
// ==========================================
// メッシュハンドル構造体
struct MeshHandle
{
	// 頂点バッファハンドル
	Handle meshVertexBufferHandles = {};
	// インデックスバッファハンドル
	Handle meshIndexBufferHandles = {};
};


// モデルハンドル構造体
struct ModelHandle
{
	// メッシュハンドル配列
	std::vector<MeshHandle> meshHandles = {};
};
