#pragma once


// ==========================================================================
// 【関数概要】
// エラー時やデバッグ時にログを出力する補助関数群
// 
// 【設計意図】
// ・プラットフォームごとに.cppを切り替えることで、GameMainなどでも共通的に使用可能
// ・ErrorLogは常時出力、DebugLogはリリースビルド時に無効化される設計
// ・DebugLogの関数はリリース時にインライン化されず空関数となることで、負荷ゼロを実現
// ==========================================================================


// ======================================
// ヘッダー
// ======================================
// 文字列ヘッダー
#include "UTF8_String.h"


// ======================================
// エラーログ（致命的な警告用）
//  (デバッグ時、プロジェクトを停止させる)
// ======================================
namespace ErrorLog 
{
    // コンソールにメッセージを出力
    void OutputToConsole(const String& message);
    // メッセージボックスでメッセージを表示
    void OutputToMessageBox(const String& message);
}


// =======================================
// 警告ログ (致命的ではない警告用)
// =======================================
namespace WarningLog
{
    // コンソールにメッセージを出力
    void OutputToConsole(const String& message);
    // メッセージボックスで出力
    void OutputToMessageBox(const String& message);
}


// ==============================================================
// デバッグログ
// Releaseビルド時は何も行わないようにしています。
// ==============================================================
namespace DebugLog
{
    // コンソールにメッセージ出力
    void OutputToConsole(const String& message);
}
