#include "ResultSceneState.h"


// ========================================
// シーンの初期化
// ========================================
bool ResultSceneState::DerivativeInit()
{
	return true;
}


// ========================================
// シーンの更新
// ========================================
void ResultSceneState::DerivatIveUpdate(float _delta)
{
}


// ========================================
// シーンの描画
// ========================================
void ResultSceneState::Draw()
{
}


// ========================================
// シーンの終了処理
// ========================================
void ResultSceneState::Uninit()
{
}
