#pragma once

// =================================================
// 【ヘッダーの概要】
// シェーダー関連で必要なデータのクラス
// =================================================


// =======================================
// ヘッダー
// =======================================
#include <string> // 文字列を扱うためのヘッダー
#include "BaseSaveLoadObject.h" // セーブロードを行うオブジェクトの基底クラス

#include "ConstantBufferInfo.h"

// =======================================
// データクラス
// =======================================



// 入力レイアウトデータクラス
struct InputLayoutInfo {
	std::string semanticName = ""; // セマンティックの名前
	int semanticIndex = 0;         // セマンティックの番号
	int inputSlot = 0;             // スロット番号
	int format = 0;                // データの形式 (DXGI)
};

