
// ======================================
// 【関数概要】
// Windows用_エラーログ出力関数群
// ======================================


// ======================================
// ヘッダー
// ======================================
// 必須ヘッダー
#include "ReportMessage.h"
// メッセージボックス用ヘッダー
#include <Windows.h> // メッセージボックス出力
// コンソール出力用ヘッダー
#include <iostream>  // コンソールに書き出す


namespace {
    // カラーコードリセット用
    constexpr const char* RESET = "\x1b[0m";
}


// ======================================
// エラーログ（致命的な警告）
// ======================================
namespace ErrorLog
{
    // カラーコード
    constexpr const char* RED = "\x1b[31m";


    // ====================================================
    // コンソールにメッセージを出力
    // ====================================================
    void OutputToConsole(const char* message)
    {
        std::cerr << RED << "ERROR :" << message << RESET << std::endl;
    }


    // =====================================================
    // メッセージボックスでメッセージを表示
    // =====================================================
    void OutputToMessageBox(const char* message)
    {
        MessageBoxA(nullptr, message, "Error", MB_ICONERROR | MB_OK);
    }


}


// ===========================================
// 警告ログ (致命的ではないエラーログ)
// ===========================================
namespace WarningLog
{
    // ANSIカラーコード
    constexpr const char* YELLOW = "\x1b[33m";


    // ====================================================
    // コンソールにメッセージを出力
    // ====================================================
    void OutputToConsole(const char* message)
    {
        std::cerr << YELLOW << "WARNING :" << message << RESET << std::endl;
    }


    // =====================================================
    // メッセージボックスでメッセージを表示
    // =====================================================
    void OutputToMessageBox(const char* message)
    {
        MessageBoxA(nullptr, message, "Warning", MB_ICONERROR | MB_OK);
    }


}


#if defined(DEBUG) || defined(_DEBUG)
// ==============================================================
// デバッグログ
// ここにある関数はリリース時はインラインでビルドを行わないように
// ==============================================================
namespace DebugLog
{
    // ===============================================
    // コンソールにメッセージ出力
    // ===============================================
    void OutputToConsole(const char* message)
    {
        std::cout << message << std::endl;
    }


}


#endif
