
// ======================================
// 【関数概要】
// Windows用_エラーログ出力関数群
// ======================================


// ======================================
// ヘッダー
// ======================================
// 必須ヘッダー
#include "ReportMessage.h"
// メッセージボックス用ヘッダー
#include <Windows.h> // メッセージボックス出力
// コンソール出力用ヘッダー
#include <iostream>  // コンソールに書き出す


// ======================================
// エラーログ（致命的または警告）
// ======================================
namespace ErrorLog
{
    // ====================================================
    // コンソールにメッセージを出力
    // ====================================================
    void OutputToConsole(const char* message)
    {
        std::cerr << "ERROR :" << message << std::endl;
    }


    // =====================================================
    // メッセージボックスでメッセージを表示
    // =====================================================
    void OutputToMessageBox(const char* message)
    {
        MessageBoxA(nullptr, message, "Error", MB_ICONERROR | MB_OK);
    }


}



#if defined(DEBUG) || defined(_DEBUG)
// ==============================================================
// デバッグログ
// ここにある関数はリリース時はインラインでビルドを行わないように
// ==============================================================
namespace DebugLog
{
    // ===============================================
    // コンソールにメッセージ出力
    // ===============================================
    void OutputToConsole(const char* message)
    {
        std::cout << message << std::endl;
    }


}


#endif
