#pragma once

// =========================================
// 【クラス概要】
// SPIR-Vリファレクションを自作リファレクションに
// 変換するモジュール
// =========================================


// =========================================
// ヘッダー
// =========================================
// 自作リファレクションのヘッダー
#include "RefarencesData.h"
// 配列ヘッダー
#include <vector>


// =========================================
// 前方宣言
// =========================================
// SPIR-Vリフレクション構造体の前方宣言
struct SpvReflectShaderModule;


// =========================================
// クラス
// =========================================
class SPIRV_SelfRefDataModule final
{
private:

public:
	// ----------------------------------------
	// コンストラクタ・デストラクタ
	// ----------------------------------------
	SPIRV_SelfRefDataModule() = default;
	~SPIRV_SelfRefDataModule() = default;


	// ----------------------------------------
	// SPIR-Vリフレクション構造体を自作のリファレクション構造体に変換する関数
	// ----------------------------------------
	bool ConvertSpvReflectToSelfRefData(
		const SpvReflectShaderModule& _spvModule,
		SelfReflectionInfo& _selfRefInfo);
};

