#pragma once

// =========================================
// 【関数概要】
// シェーダーに関するユーティリティクラス
// =========================================


// =========================================
// ヘッダー
// =========================================
// 文字列ヘッダー
#include "UTF8_String.h"
// シェーダー列挙型
#include "UseShaderType.h"


// =========================================
// 名前空間
// =========================================
namespace ShaderUtility
{
	// ファイル名からシェーダータイプを取得する関数
	SETSHADERTYPE GetShaderTypeFromFileName(const String& fileName);
}
